# CannotApplyGridSpecification Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..CannotApplyGridSpecification Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
It is not possible to apply the host family's grid specification to this instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotApplyGridSpecification { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotApplyGridSpecification As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotApplyGridSpecification {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace